WSAgent/Class/WSDl_updated.wsdl

<wsdl:definitions xmlns:http="http://schemas.xmlsoap.org/wsdl/http/" xmlns:mime="http://schemas.xmlsoap.org/wsdl/mime/" xmlns:ns="http://c.b.a" xmlns:ns1="http://org.apache.axis2/xsd" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xs="http://www.w3.org/2001/XMLSchema" targetNamespace="http://c.b.a">    <wsdl:documentation>Calculator</wsdl:documentation>    <wsdl:types>        <xs:schema attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://c.b.a">            <xs:element name="add">                <xs:complexType>                    <xs:sequence>                        <xs:element minOccurs="0" name="n1" type="xs:int"/>                        <xs:element minOccurs="0" name="n2" type="xs:int"/>                    </xs:sequence>                </xs:complexType>            </xs:element>            <xs:element name="addResponse">                <xs:complexType>                    <xs:sequence>                        <xs:element minOccurs="0" name="return" type="xs:int"/>                    </xs:sequence>                </xs:complexType>            </xs:element>        </xs:schema>    </wsdl:types>    <wsdl:message name="addRequest">        <wsdl:part element="ns:add" name="parameters"/>    </wsdl:message>    <wsdl:message name="addResponse">        <wsdl:part element="ns:addResponse" name="parameters"/>    </wsdl:message>    <wsdl:portType name="CalculatorPortType">        <wsdl:operation name="add">            <wsdl:input message="ns:addRequest" wsaw:Action="urn:add"/>            <wsdl:output message="ns:addResponse" wsaw:Action="urn:addResponse"/>        </wsdl:operation>    </wsdl:portType>    <wsdl:binding name="CalculatorSoap11Binding" type="ns:CalculatorPortType">        <soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>        <wsdl:operation name="add">            <soap:operation soapAction="urn:add" style="document"/>            <wsdl:input>                <soap:body use="literal"/>            </wsdl:input>            <wsdl:output>                <soap:body use="literal"/>            </wsdl:output>        </wsdl:operation>    </wsdl:binding>    <wsdl:binding name="CalculatorSoap12Binding" type="ns:CalculatorPortType">        <soap12:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>        <wsdl:operation name="add">            <soap12:operation soapAction="urn:add" style="document"/>            <wsdl:input>                <soap12:body use="literal"/>            </wsdl:input>            <wsdl:output>                <soap12:body use="literal"/>            </wsdl:output>        </wsdl:operation>    </wsdl:binding>    <wsdl:binding name="CalculatorHttpBinding" type="ns:CalculatorPortType">        <http:binding verb="POST"/>        <wsdl:operation name="add">            <http:operation location="add"/>            <wsdl:input>                <mime:content part="parameters" type="text/xml"/>            </wsdl:input>            <wsdl:output>                <mime:content part="parameters" type="text/xml"/>            </wsdl:output>        </wsdl:operation>    </wsdl:binding>    <wsdl:service name="Calculator">        <wsdl:port binding="ns:CalculatorSoap11Binding" name="CalculatorHttpsSoap11Endpoint">            <soap:address location="http://127.0.0.1:8080/operations/services/Calculator.CalculatorHttpsSoap11Endpoint"/>        </wsdl:port>        <wsdl:port binding="ns:CalculatorSoap11Binding" name="CalculatorHttpSoap11Endpoint">            <soap:address location="http://127.0.0.1:8080/operations/services/Calculator.CalculatorHttpSoap11Endpoint"/>        </wsdl:port>        <wsdl:port binding="ns:CalculatorSoap12Binding" name="CalculatorHttpSoap12Endpoint">            <soap12:address location="http://127.0.0.1:8080/operations/services/Calculator.CalculatorHttpSoap12Endpoint"/>        </wsdl:port>        <wsdl:port binding="ns:CalculatorSoap12Binding" name="CalculatorHttpsSoap12Endpoint">            <soap12:address location="http://127.0.0.1:8080/operations/services/Calculator.CalculatorHttpsSoap12Endpoint"/>        </wsdl:port>                    </wsdl:service>
</wsdl:definitions>
